-- phpMyAdmin SQL Dump
-- version 6.0.0-dev+20231004.3c21a0e0d2
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1
-- Généré le : Ven. 06 Oct. 2023 à 14:58
-- Version du serveur : 10.4.24-MariaDB
-- Version de PHP : 8.1.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données : `academy`
--

-- --------------------------------------------------------

--
-- Structure de la table `allrecords`
--

CREATE TABLE `allrecords` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `time` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `langue` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `id-course` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `desc1` varchar(10000) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `allrecords`
--

INSERT INTO `allrecords` (`id`, `name`, `image`, `price`, `time`, `langue`, `id-course`, `desc1`, `created_at`, `updated_at`) VALUES
(1, 'علم البيانات\nباستخدام بايثون', 'python-data.png', '465 ', '60', '', '1', 'صُممت دورة علم البيانات باستخدام لغة بايثون باستخدام Python لتمكين المشاركين من تحليل البيانات والتنبؤ بالعديد من مشكلات الحياة الواقعية باستخدام العديد من مجموعات البيانات الواقعية باستخدام خوارزميات ML الأكثر شيوعًا مثل التصنيف والتجميع بمساعدة لغة برمجة .Python\n\nتركز الدورة على المهارات الأساسية المطلوبة لعالم البيانات، حيث يتم تمكين المشتركين من أساسيات البرمجة باستخدام Python، بالإضافة إلى الموضوعات المتقدمة مثل التعلم العميق والتعتيم ونشر النماذج، باستخدام أحدث المعارف والتقنيات في هذا المجال.', NULL, NULL),
(2, 'تطوير المواقع الإلكترونية Asp.net core', 'aps.net.png', '212 ', '20', '', '1', '\nصممت دورة تطوير المواقع الإلكترونية asp.net core لتمكين المشاركين من إنشاء العديد من أنواع التطبيقات المختلفة باستخدام نظام أساسي للمطورين يتكون من أدوات ولغات برمجة ومكتبات، حيث يعمل ASP.NET  بشكل أسرع من أي إطار عمل ويب معروف، إذ يدعم بروتوكولات المصادقة القياسية في الصناعة.\n\nفي هذه الدورة سيتمكن المشارك من تطوير C# باستخدام ASP.NET CORE MVC وذلك عن طريق استخدامVisual Studio ، بالإضافة إلى التمكّن من إنشاء تطبيق ويبC# ASP.NETCORE MVC ، وإجراء تغييرات عليه، كما سيتمكّن المشترك من استكشاف بعض ميزاتIDE  قبل التمكن من تشغيل التطبيق. كما تهدف هذه الدورة إلى تعريف المشارك بلغة البرمجة لاستخدام التقنيات الرئيسية المستخدمة في البرمجة كائنية التوجهOOP ، إضافة إلى إلمام المشاركين بمفاهيم تعريفية وتطبيقية لـ HTMLو MVC..\n\nمن خلال دورة ASP.net CORE MVC سيتم تمكين المشاركين من إنشاء مواقع ديناميكية وتعلّم كيفية التحكم بها وتطويرها، حيث تتضمن الدورة لعديد من المحاور التي تمكن المستخدم من تطوير هذه المواقع وإنشاء تطبيقات متطورة تستخدم أحدث معايير الويب، بالإضافة إلى تطوير الخدمات ونشرها في البيئات المختلطة بما في ذلك الخوادم المحلية Windows   Azure.\n\nسيتمكّن المشتركون من خلال هذه الدورة من استخدام تطبيقات الويب في Azure لنشر موقع الويب الخاص بهم، مما سيطوّر من مهاراتهم في إدارته بسهولة دون الحاجة إلى العمل مع الخوادم الأساسية، أو وحدات التخزين، أو أصول الشبكة، كما يمكنهم التركيز على ميزات موقع الويب الخاص بهم والاعتماد على نظام Azure الأساسي لتوفير وصول آمن إلى موقعهم، بالإضافة إلى تعريف المشتركين بكيفية تنفيذ ميزات الأمان في التطبيق.', NULL, NULL),
(5, 'تطوير تطبيقات الهاتف باستخدام برنامج Flutter', 'flutter.jpeg', '420 ', '30', '', '1', 'Flutter عبارة عن مجموعة تطوير برامج واجهة مستخدم مفتوحة المصدر تم إنشاؤها بواسطة Google يتم استخدامها لتطوير تطبيقات Android و iOS و Linux و Mac و Windows و Google Fuchsia والويب من قاعدة بيانات واحدة.\n\n \n\nتركز هذه الدورة على بناء المهارات الأساسية التي تمكن المتدرب من بناء تطبيقات Android و IOS باستخدام flutter ، بالإضافة إلى معرفة قوية بلغة برمجة  .Dart\n\n ', NULL, NULL),
(6, 'Microsoft Azure Security Technologies AZ-500', 'microsoftsecurity.jpeg', '353 ', '35', '', '2', '\nتقدم هذه الدورة لمحترفي مجال أمان تكنولوجيا المعلومات الذين ينفذون ضوابط الأمان ويديرون الهويات ويحمون البيانات والتطبيقات في المؤسسات، حيث ستتمكن خلال الدورة من معرفة كيفية إدارة هويات Azure والوصول إليها، وتحديد آليات حماية البيانات وتأمينها، وتأمين بروتوكولات الإنترنت على Azure.', NULL, NULL),
(7, 'Microsoft MCSA 2016\nمساعد الحلول المعتمد\n', 'mcsa.jpg', '677 ', '90', '', '2', 'تهدف دورة MCSA إلى تزويد المشاركين بالمعرفة اللازمة حول أحدث الانظمة والتقنيات المرتبطة بـ Server Management والخاص بشركة Microsoft وتمكينهم من العمل عليها وإدارتها والتعامل مع قواعد بيانات موارد الشبكة والخدمات والمستخدمين وخدمات شبكات مايكروسوفت والأمن والتحكم عن بعد ومعرفة مفاهيم التصميم بحيث تشمل الدورة تدريباً شاملاً للتمكن من استخدام حلول مايكروسوفت عن طريق تكنولوجيا عالية الجودة ومختبرات مجهزة بشكل كامل.', NULL, NULL),
(8, 'مقدمة في علم التشفير', 'crypto.png', '127 ', '90', '', '2', 'تهدف دورة MCSA إلى تزويد المشاركين بالمعرفة اللازمة حول أحدث الانظمة والتقنيات المرتبطة بـ Server Management والخاص بشركة Microsoft وتمكينهم من العمل عليها وإدارتها والتعامل مع قواعد بيانات موارد الشبكة والخدمات والمستخدمين وخدمات شبكات مايكروسوفت والأمن والتحكم عن بعد ومعرفة مفاهيم التصميم بحيث تشمل الدورة تدريباً شاملاً للتمكن من استخدام حلول مايكروسوفت عن طريق تكنولوجيا عالية الجودة ومختبرات مجهزة بشكل كامل.', NULL, NULL),
(9, 'مايكروسوفت أزور - Microsoft Azure AZ-104', 'Azure.png', '705', '35', '', '2', 'صممت دورة  Microsoft Azure Administrator Associate AZ-10لتمكين المشاركين من إنشاء تجارب متعددة المنصات مترابطة ومصممة خصيصًا لتفاعلات العملاء باستخدام الذكاء الاصطناعي والتعلم الآلي، حيث سيتعلم المشاركون كيفية إدارة اشتراكات Azure الخاصة بهم، كما سيتمكنون من تطبيق ممارسات إدارة الهويات الآمنة، وإدارة البنية التحتية.\r\n\r\nكما تساعد هذه الدورة على تطوير قدرة المشاركين على تكوين الأنظمة الوهمية، لتزود المشاركين بكيفية توصيل Azure مع المواقع المحلية، وإدارة حركة مرور الشبكة، بالإضافة إلى التطرق إلى تنفيذ حلول التخزين، مما يرفع من مهارة المشاركين في إنشاء أجهزة افتراضية وتوسيع نطاقها.', NULL, NULL),
(10, 'أمن المعلومات +Security', 'security.jpeg', '170', '30', '', '2', 'ضمان أمن وسلامة الشبكات والمعلومات الشخصية أحد أهم الأمور التي يبحث عنها مستخدمي الحواسيب والأجهزة المحمولة والذكية، لذلك تعتبر هذه الدورة مرجعاً أساسياً ومهماً لك لضمان الحصول على المعلومات والمعرفة اللازمة لتحديد التهديدات الأمنية التي قد تهدد شبكتك الخاصة وتقوية الأنظمة والبنية التحتية الأمنية.\r\n\r\nتؤهلك الدورة للنجاح في امتحان كومبتيا أمن الحاسوب CompTIA Security +، حيث تتضمن تعريفاً شاملاً بالمواضيع المختلفة في مجال أمن وحماية الحواسيب والشبكات، وكذلك مدى ارتباط مجال أمن الشبكات بالمجالات الأخرى في تكنولوجيا المعلومات.', NULL, NULL),
(11, 'فني الخوادم Server+', 'sever.jpg', '254', '30', '', '2', 'صممت الدورة التدريبية فني الخوادم  لرفع كفاءة  المشاركين بالمعرفة والمهارات اللازمة لبناء وصيانة واستعادة ودعم وتأمين  وتقنيات البرمجيات الخاصة بالخادم ، بما في ذلك المحاكاة الافتراضية.\r\n\r\nتهدف الدورة التدريبية أيضًا إلى تحديد المشكلات البيئية وفهم إجراءات الامتثال للأمن والحماية العامة والامتثال لها ، والتعرف على مصطلحات ومفاهيم الصناعة وفهم أدوار الخادم وتفاعلها في بيئة الحوسبة الديناميكية.', NULL, NULL),
(12, 'متخصص تقنيات سيسكو لشبكات المؤسسات - CCNP (ENCOR)', 'CCNP.jpeg', '550 ', '70', '', '2', ' تم تصميم دورة متخصص تقنيات سيسكو لشبكات المؤسسات لإثراء المعرفة والمهارات اللازمة لتكوين الشبكات السلكية واللاسلكية للمؤسسات واستكشاف الأخطاء وإصلاحها وإدارتها.\r\n تمكّنك الدورة من تطبيق مبادئ الأمان داخل شبكة المؤسسة وكيفية تراكب تصميم الشبكة باستخدام حلول مثل SD-Access و SD-WAN.، بالاضافة الى اعدادك لأداء امتحان 350-401 لتطبيق تقنيات (Cisco Enterprise Network Core (ENCOR', NULL, NULL),
(13, 'الهاكر الأخلاقي المعتمد CEH', 'hackers.jpeg', '972', '70', '', '2', 'صممت دورة الهاكر الأخلاقي المعتمد CEH لتمكين المشترك من فهم أنظمة المعلومات والشبكات وأنظمة الحماية والأمان، حيث سيتم تعريف المشترك خلال الدورة على أبز التهديدات الأمنية التي تواجه أنظمة الشبكات والمعلومات وناقلات الهجوم المتقدمة، وأحدث تقنيات القرصنة.\r\n\r\nسيتم تعريف المشترك خلال الدورة بأهم المنهجيات والأدوات والحيل والتدابير الأمنية الواجب اتباعها لتحديد نقاط الضعف في الأنظمة المعلوماتية المستهدفة وذلك باستخدام الأدوات التي يستخدمها الهاكر لتقييم الوضع الأمني للنظام، حيث سيتم تدريب المشترك عملياً في مختبرات متقدمة وجلسات تفاعلية خاصة بكل موضوع نظري', NULL, NULL),
(14, 'مساعد شبكات معتمد CCNA', 'ccna.jpeg\r\n', '229 ', '80', '', '2', 'صممت دورة مساعد شبكات معتمد CCNA لتزويد المشتركين بالمهارات والمعرفة اللازمة التي تمكنهم من إدارة أجهزة التبديل والتحويل بما في ذلك تركيب وإعداد وتشغيل وصيانة هذه الأجهزة، بالإضافة إلى فهم عناوين بروتوكول الإنترنت IP بشكل مفصل، وفهم الشبكات الفرعية والتشغيلية.\r\n\r\nسيتمكن المشترك خلال الدورة من إدراك كيفية تدفق البيانات في الشبكة وفقاً لنموذج الربط البيني للأنظمة المفتوحة OSI، وتوصيل الأسلاك والكابلات مثل UTP وSTP، وتهيئة بروتوكولات التوجيه مثل RIP وOSPF وEIGRP، بالإضافة تعلّم كيفية تهيئة قوائم الوصول وترجمة عناوين الشبكة لتوصيل الموجه بالإنترنت، مما يساعد المشترك على فهم كافة المهارات المتخصصة في مجال أمن الشبكات والشبكات اللاسلكية.', NULL, NULL),
(15, 'تدريب المدربين', 'ent.jpg', '493', '30', '', '3', 'صممت دورة تدريب المدربين لإلمام المشاركين بأكثر الطرق فعالية في تحويل المعلومات إلى مهارات وتطبيقات عملية، حيث تركز هذه الدورة على مشاركة الأفكار والخبرات بدلا من التركيز على مجرد نقل المعلومات، لتساهم في بناء قدرات المشاركين وتطوير مهاراتهم في تنفيذ الخطط التدريبية.\r\n\r\nكما تهدف هذه الدورة إلى تطوير إدارة الموارد البشرية في المنظمة مع التركيز على قدرات المدرب ومهاراته التدريبية بدلا من التركيز على اكتساب المعرفة فقط، كما سيتعرف المشاركون على الأساليب المختلفة لتقييم الاحتياجات التدريبية، إذ ستتوفر لديهم أسس وهياكل استراتيجية التدريب التي من خلالها سيتحقق التنفيذ المستدام للممارسات الجديدة.', NULL, NULL),
(16, 'إعداد المدرب الشخصي', 'gym.jpg', '211', '35\r\n', '', '3', 'دورة تدريبية\r\nتهدف دورة إعداد المدرب الشخصي إلى مساعدة المشاركين على دراسة مدى تأثير الرياضة على وظائف الأعضاء وتركيبة الجسم لتمكينهم من اكتساب المعرفة والخبرة اللازمة في إعداد برامج التدريب وتقييمات اللياقة واستخداماتها، بحيث تغطي الدورة محاور التشريح العضلي، فسيولوجيا التدريب الرياضي، علم الحركة والميكانيكا الحيوية، الإعداد البدنى ومبادىء التدريب، التغذية الرياضية الصحيحة، المكملات الغذائية، تقييم اللياقة البدنية، كيفية تصميم البرنامج التدريبي، وكيفية التعامل مع المتدرب.', NULL, NULL),
(17, 'اكسل - المستوى الأساسي والمتوسط', 'exel.jpeg', '212 ', '20', '', '3', 'تمكنك الدورة من احتراف استخدام برنامج اكسل الذي يعتبر أحد أهم برامج شركة مايكروسوفت في مختلف المجالات، حيث ستتمكن من اتقان كافة مهارات وعمليات البرنامج من تحليل البيانات والحسابات والميزانيات والفواتير، بالإضافة إلى استخدام الجداول البيانية لتنفيذ العمليات الحسابية الأساسية والمتقدمة، وفهم كيفية إضافة وحذف الصفوف والأعمدة.\r\n\r\nبعد الانتهاء من الدورة ستكون قادراً على القيام بالمهام العملية المختلفة باحترافية أكثر والاستفادة من البرنامج بالطريقة الصحيحة', NULL, NULL),
(18, 'اكسل - المستوى المتقدم', 'exel.jpeg', '212', '26', '', '3', 'يُعدّ إتقان استخدام برنامج مايكروسوفت اكسل Excel من المهارات الأساسية التي على كل محترف الإلمام بها، فتم تصميم دورة اكسل المتقدم على نحوٍ يمكّن المشاركين من الإلمام بالمهارات العملية اللازمـة لاستخدام برنامج اكسل والتمكّن من أدواته المختلفة بما فيها طرق إعداد وبناء المعادلات والمقارنات والجداول المحورية واستخراج البيانات اللازمة لاتخاذ القرارات، بحيث سيقومون بتحليل البيانات بشكل متقدم و استخراج النتائج لاتخاذ القرار السليم والمناسب باستخدام الصيغ الرياضية المتقدمة واستخدام الخيارات اللازمة لتحليل البيانات واستعراضها.', NULL, NULL),
(19, 'المحاسبة العملية', 'calcul.jpg', '352 ', '20', '', '3', '\r\nصُممت دورة المحاسبة العملية لتأهيل المشتركين لدخول مجالات العمل المختلفة في مهنة المحاسبة، حيث يتم خلال الدورة تعريف المشتركين بأهم متطلبات العمل في مهنة المحاسبة وتطوير مهاراتهم الفنية لمواكبة التطورات الحديثة في هذه المهنة.\r\n\r\nتهدف الدورة إلى اكساب المشتركين العديد من المهارات المالية والفنية وتعزيز قدراتهم على استخدام أحدث التقنيات المحاسبية من أجل الوصول إلى الوظيفة المثالية والعصرية.\r\n\r\nتتضمن الدورة محاور تقدم تطبيقات وحالات عملية لتسجيل العمليات المالية وإعداد القوائم المالية من خلال الحاسوب ومناقشتها باستخدام أساليب العصف الذهني، بالإضافة إلى تزويد المشترك بتطبيقات ودراسات عملية في مجال المحاسبة والعمليات المالية', NULL, NULL),
(20, 'البرنامج التدريبي للعاملين بالعمل الانساني الخيري', 'azrty.webp', '353 ', '16', '', '3', 'يساهم بناء قدرات العاملين في المؤسسات الخيرية وتعزيز دورها في التنمية البشرية في تحقيق التنمية المستدامة والمساعدة في رسم السياسات والخطط وعمل الحملات التسويقية والترويجية والتعامل مع وسائل الإعلام، وتسليط الضوء على دور العلاقات وأهميته كمحرك رئيس للمنظمات الخيرية، وغيرها من المحاور الرئيسة التي لا بد من الوقوف عندها', NULL, NULL),
(21, 'دبلوم ادارة الموارد البشرية', 'hr.jpg', '916', '60', '', '3', 'في ظل التغييرات والتطور الحالي في الأعمال وفي البيئة الإجتماعية الديناميكية، تعد إدارة الموارد البشرية الفعالة القوة الدافعة وراء نجاح الأعمال والمؤسسات، حيث ان إدراك قدرات ومساهمات الموظفين وقيمهم الفريدة أمر أساسي لبناء مشروع تجاري عظيم. يهدف برنامج دبلوم إدارة الموارة المشرية المعتمد من الكلية البريطانية المركزية إلى إكساب المتدرب الخبرة العملية والمعرفة العلمية للعمل في مجال إدارة الموارد البشرية في مختلف قطاعات الأعمال، يتضمن الدبلوم جميع تخصصات الموارد البشرية بواقع 70 ساعة تدريبية لتمكين المشاركين من الحصول على مناصب كمدراء موارد بشرية معتمدون والمساهمة في صياغة أنظمة إدارة الموارد البشرية التي تمكن المؤسسات من تحقيق أهداف العمل الاستراتيجية وتعزيز الأداء التنظيمي الشامل.\r\nلقد تم تطوير برنامج دبلوم إدارة الموارد البشرية المعتمد لتزويد المتدربين بالمعرفة والمهارات الأساسية ليصبحوا محترفين ناجحين في مجال الموارد البشرية بحيث يغطي مواضيع متنوعة في الموارد البشرية مثل: دور موظفي ومدراء الموارد البشرية في التوظيف، التدريب، تقييم الموظفين وتحفيزهم، إدارة علاقات الموظفين بأرباب العمل، وإدارة التغيير داخل المؤسسة، بالإضافة إلى ذلك، سيتم تعريف المتدربين بالمبادئ والمفاهيم العامة والجوانب القانونية للموارد البشرية.', NULL, NULL),
(22, 'المحاسب الاداري المعتمد\r\nالجزء الأول', 'calcjpg.jpg', '634', '79', '', '3', 'تعتبر شهادة المحاسب الإداري المعتمد CMA الصادرة عن معهد المحاسبين الإداريين في الولايات المتحدة الأمريكية IMA من أهم الشهادات في مجالات الإدارة والمحاسبة، لذلك صُممت دورة المحاسب الإداري المعتمد بجزأيها الأول والثاني لتمكين المشتركين من كافة المواضيع المالية المتعلقة بشركاتهم وأعمالهم المتمثلة في تحليل للبيانات المالية والرقابة المالية ومحاسبة التكاليف وإدارة المخاطر واتخاذ القرارات المالية والتجارية استناداً إلى البيانات المالية.', NULL, NULL),
(23, 'محترف سلاسل الإمداد', 'sel.jpeg', '493 ', '24', '', '3', 'صُممت دورة محترف سلاسل الإمداد لتمكين المشتركين من تحسين أدائهم وتطوير حياتهم المهنية وتعزيز قدرتهم على التنسيق بين كافة الأطراف التي تتعامل معها شركاتهم، مما يسهم في إيصال المنتجات والخدمات للعملاء بأفضل صورة، بالإضافة إلى تحسي عمليات التنسيق ما بين أقسام الشركة المختلفة وتحسين الأداء والوصول إلى أفضل منتج.\r\n\r\nتسهم هذه الدورة في جعل عملية التصنيع المعقدة سهلة بالإضافة الى تخفيض التكاليف، وذلك من خلال تعزيز قدرة المشترك على إدارة الحركة ونقل وتدفق البضائع وتخزين المواد الخام والسلع والمخزون من نقطة البداية من تصنيع وإنتاج المنتج الى نقطة وصول المنتج الى المستهلك في الوقت المناسب بأقل التكاليف', NULL, NULL),
(24, 'المسوق الرقمي المعتمد', 'التسويق-الرقمي.webp', '775 ', '40', '', '3', 'تمكنك هذه الدورة من تطوير مهاراتك في عملية التسويق الرقمي، من خبرة عملية واسعة في تخصصات تحسين محركات البحث، وتحليلات الويب وتسويق المحتوى والتسويق عبر الهاتف المحمول ووسائل التواصل الاجتماعي، بالإضافة إلى رفع مستوى إتقانك للمهارات والمعرفة، من خلال تقديم أحدث مفاهيم التسويق الرقمي باستخدام التطبيقات الخاصة.\r\n\r\n تم إعداد هذه الدورة التدريبية خصيصًا للمهنيين ورجال الأعمال والأفراد الطامحين الذين ينوون توسيع مهاراتهم واكتساب الخبرة في مجال التسويق الرقمي.', NULL, NULL),
(25, 'ماجستير ادارة الأعمال المصغر', 'mba.jpeg', '916 ', '75', '', '3', 'صُمم برنامج Mini MBA بطريقة احترافية ومن خلال مجموعة رائدة من رواد الأعمال المعروفين والمدربين المعتمدين دوليًا في عالم إدارة الأعمال. يهدف البرنامج إلى تزويدك بفهم شامل ومهارات ومعرفة وخبرات تدريبية وخبرة وظيفية في جميع مجالات ووظائف إدارة الأعمال، بالإضافة إلى تمكينك من تطبيق المعرفة المكتسبة في مجالات التخطيط الاستراتيجي والمالي، والإدارة والتسويق والعمليات وسلسلة التوريد والموارد البشرية وإدارة المشاريع، حيث يركز البرنامج على الحاجة إلى ممارسة التطبيق العملي لضمان دراسته من منظور علمي وعملي وأن تصل إلى مرحلة متقدمة من المعرفة والتوعية، في نهاية البرنامج ستحصل على شهادات مهنية معتمدة.\r\n\r\nتم تصميم دورة التخطيط الاستراتيجي لتكون برنامجًا تدريبيًا يهدف إلى توضيح طريقة الإعداد وتنفيذ الخطط الاستراتيجية بكفاءة والتي تعمل من خلالها المؤسسة على تحديد استراتيجيتها أو اتجاهها، واتخاذ القرارات بشأن تخصيص مواردها لمتابعة هذه الاستراتيجية، بالإضافة إلى آليات الرقابة لتوجيه تنفيذها. يعتبر التخطيط الاستراتيجي جانبا هاما من جوانب الإدارة الاستراتيجية التي يقوم بها المخططون الاستراتيجيون.\r\n\r\nمن خلال الدورة ستتمكن من تطوير قدرتك على تحديد نقاط القوة والضعف والفرص والتحديات التي تواجه المنشأة التي تعمل بها، وتحديد الأهداف الرئيسية وتصميم الخطط الاستراتيجية، حيث تساعد عملية التخطيط على ضمان دراسة الخطط بالشكل الكامل وبطريقة مرنة وعملية ومجدية اقتصاديًا، بالإضافة إلى الاستفادة من الأخطاء التي قد تحدث خلال مراحل المشروع في المشاريع المستقبلية واتخاذ القرارات بناءً عليها، كما ستتم مناقشة الاختلاف بين أنواع التخطيط؛ الاستراتيجية والتشغيلية، وكذلك الأساليب التحليلية المختلفة المستخدمة في التخطيط الاستراتيجي مثل تحليل بوتر، وتحليل الفجوة الاستراتيجية، وتحليل بوسطن، وتحليل PESTEL، وتحليل SWOT، بالإضافة إلى تحديد مفهوم KPI، وكيفية مراقبة تنفيذ الخطة الاستراتيجية الموضوعة.', NULL, NULL),
(26, 'الرسم ثلاثي الأبعاد 3D ماكس', '3D.jpeg', '148 ', '24', '', '4', 'مستوى 1\r\nصممت دورة 3Ds MAX  لتمكين المشاركين من استخدام برنامج 3Ds MAX الخاص بإعداد النماذج والتصاميم ثلاثية الأبعاد، لتجسيد التصاميم، وتطوير الألعاب، والرسوم المتحركة بشكل مرئي. سيتمكّن المشاركون خلال هذه الدورة من إنشاء نموذج يشمل أدق التفاصيل وأكثر النماذج تعقيدا ليحقق رؤيتهم بجودة عالية، وذلك من خلال استخدام أدوات عديدة الوظائف إلا أنها سهلة الاستخدام، حيث أن دقة وسهولة هذا البرنامج تساعد أيضا على تصميم النماذج المعمارية، ويمكن استخدامه في العديد من المجالات، حيث يمكن استخدامه أيضا لمحاكاة السيناريوهات الفيزيائية وديناميكيات الحركة للسوائل والغازات والمواد الصلبة، كما سيتمكّن المشارك أيضًا من تهيئة لقطات كاميرا شبيهة بالواقع، مما يضيف مزيدًا من العمق إلى عمله، ويتميز هذا البرنامج بالدقة، حيث تتاح للمشارك إمكانية تحريك الكائنات في اتجاهات مختلفة واستخدام أشكال الشبكة والسطح وذلك بالاعتماد على المراجع الهندسية، كما يتيح هذا البرنامج خيار استخدام نماذج جاهزة من شأنها تسريع إنجاز العمل، إذ لديه واجهة برمجة تطبيقات (API)  مفتوحة للمساعدة على دمج التطبيقات الخارجية.', NULL, NULL),
(27, 'ادوبي افتر افكت', 'ae.jpeg', '198 ', '20', '', '4', 'صُممت دورة أدوبي أفتر افكت لتمكين المشتركين من استخدام برنامج أدوبي آفتر ايفيكت، حيث يتم تعريفهم على أهم الأدوات المستخدمة في البرنامج ونظام التركيب للطبقات والأدوات المساعدة وفلاتر إضاءة الكاميرات وتوزيع الزمن.\r\n\r\nيتم تعريف المشترك خلال الدورة على كيفية إنشاء الرسوم المتحركة والتأثيرات البصرية وتحريك الصور والفيديو ثلاثية وثنائية الأبعاد، بالإضافة إلى عمليات إعداد الموشن جرافيك والخدع السينمائية وتصميم وصناعة الفيديوهات الرقمية والأفلام والعمل مع الطبقات واستخدام الرسوم المتحركة للنصوص وإنشاء عناوين رسوم متحركة ديناميكية.\r\n\r\nتتضمن الدورة تدريباً عملياً، حيث يقوم المشتركين بإعداد مشروع نهائي بتصميم شعار وإخراجه على شكل فيديو لاجتياز الدورة لضمان تحقيق الأهداف المرجوة.', NULL, NULL),
(28, 'الرسم ثلاثي الابعاد 3D ماكس - المستوى 2', '3D.jpeg', '198 ', '24', '', '4', 'صُممت دورة الرسم ثلاثي الأبعادDs Max 3 المستوى الثاني بحيث تشمل مبادئ تصميم الإضاءة الخارجية والداخلية، فسيتعرف المشارك على طرق انتشار الحزم الضوئية وطريقة احتساب الظلال بالمشهد، بالإضافة إلى مقدمة عامة في استخدام المصادر الضوئية  V-Rayواستخدام الكاميرا الخاصة به، كما سيتم تعريف المشارك على المواد الأساسية الخاصة بالـ V-Ray من كروم، وزجاج، وما إلى ذلك .\r\n\r\nفي نهاية هذه الدورة ومن أجل ضمان تحقيق الطلاب لأهداف البرنامج، يتعين على المشترك تقديم مشروع خاص بتصميم حجرة Booth، إضافة إلى الإضاءة المناسبة والكاميرا واختيار المادة المناسبة بالإضافة إلى خلفية بالتصوير بالمدى الديناميكي العالي HDR.\r\n\r\n', NULL, NULL),
(29, 'ادوبي بريميير برو', 'pr.png', '170 ', '24', '', '4', 'تحرير الفيديو هو فن تجميع الفيديو والصوت والصور والعناوين بشكل متسلسل يغطي الأفكار بحيث يعد التحرير العملية الأخيرة في سلسلة إنتاج الفيديو. تم تصميم دورة ادوبي بريميير برو Adobe Premiere Pro CC لتمكين المشاركين من الاستفادة من برنامج ادوبي بريميير برو لمشاريع تحرير الفيديو لوسائل الإعلام الاجتماعية، مواقع الويب، وفيديوهات المنتجات التوضيحية الخاصة بالشركات وغيرها من الأغراض الترويجية أو التعليمية؛ لإيصال الأفكار والرسائل باستخدام أقوى أدوات تحرير مقاطع الصوت والفيديوهات. فتبدأ الدورة بمقدمة عامة لتعريف المشاركين على أنواع مقاطع الفيديو، وكذلك تنسيق الصور ومقاطع الصوت، وبعد ذلك سيتم تغطية التقنيات والأدوات المتقدمة للبرنامج والتي تشمل تقنيات استيراد الأصول، تقنيات التحرير، إنشاء العناوين، التطبيق والعمل مع المؤثرات، إضافة وتحرير المؤثرات الانتقالية، تحليل وتثبيت اللقطات، الكروما، تقنيات التحرير المتقدمة، الحركة، الصوت، والتصدير لأغراض البث، الويب، وسائل الإعلام الاجتماعية والأجهزة النقالة، فهذه الدورة تعد مثاليةً لمن يرغب باحتراف مهمة تحرير الفيديو.', NULL, NULL),
(31, 'سكتش أب', 'skatch.png', '212', '26', '', '4', 'يعتبر برنامج الرسم الهندسي السكتش أب SketchUp من البرامج السهلة والمتميزة التي يسهل تعلمها والإبداع فيها، إن للبرنامج قابلية كبرى في إنتاج رسوم هندسية ثلاثية الأبعاد بالغة الدقة والجودة العالية وكذلك إنتاج رسوم ثنائية الأبعاد بخطوات سهلة وسريعة. وكذلك، إن البرنامج عمليا كغيره من البرامج الهندسية يعتمد بعد تعلمه على مهارات المستخدم وإمكانياته في التخيل النهائي للرسم أو التصميم وبالتالي سوف يكون قادرا على التعرف على آليات وأدوات الرسم المتوفرة في البرنامج حيث يراعي هذا البرنامج عدة تخصصات مثل التصميم الداخلي والمعماري والميكانيك.\r\n\r\nتهدف هذه الدورة إلى تزويد المتدربين بأسس ومبادىء صحيحة في الرسم الهندسي بالإضافة إلى تمكينهم من رسم مخططات ثلاثية الأبعاد بشكل تفصيلي وإضافة التفاصيل المهمة كالأبعاد والتأثيرات الخارجية.', NULL, NULL),
(32, 'ادوبي فوتوشوب', 'ps.jpg', '212', '30', '', '4', 'صممت دورة  Adobe Photoshop  بمستوييها المبتدئ والمتوسط لتمكين المشاركين خطوة بخطوة من استخدام أفضل برنامج للتصميم الجرافيكي، حيث تهدف الدورة إلى تمكينهم من استخدام برنامج Photoshop  لتعريف المشارك بكيفية إنشاء مستند جديد من الصفر إلى الطباعة الرقمية، إضافة إلى تطوير مهارات إنشاء التصاميم البصرية المتنوعة، وإنشاء الصور المتحركة، مع القدرة على إجراء تعديلات بسيطة على مقاطع الفيديو في الإصدارات الحديثة، والتمكّن من تعديل الصور الفوتوغرافية، والتلاعب بالصور والتصميمات بإدخال أو إزالة أجزاء أخرى غير موجودة بالملف الأصلي، كما سيكتسب المشارك مهارة التعامل مع أنظمة القياس، والعمل مع الطبقات وأنماط الطبقات باستخدام أدوات التحديد.\r\n\r\nكما تهدف الدورة إلى إكساب المشاركين مهارات تحرير الصور، ومعالجتها، وتعديل التصوير رقميا بطريقة احترافية، لتوفير حلول مبتكرة من خلال التقنيات والمميزات والأدوات التي يوفرها البرنامج، بحيث يمكّن المستخدم من إنشاء رسومات جديدة ومبتكرة للوسائط المطبوعة والرقميّة.', NULL, NULL),
(33, 'ادوبي إليستريتور', 'Ai.jpg', '148', '26', '', '4', 'صُممت دورة أدوبي إليستريتور Adobe Illustrator CC بمستواها الأول لتمكين المشتركين من استخدام برنامج Adobe Illustrator بشكل أكثر احترافية وسهولة، حيث يتم تعريفهم على كيفية إنشاء مستندات وتخطيطات جديدة من الصفر لأنظمة الطباعة والقراءة الرقمية، بالإضافة إلى تمكينهم من العمل مع المسارات والنقاط والألوان وتصدير الوثائق، والتعامل مع الخطوط.\r\n\r\nسيتمكن المشترك خلال الدورة من تعلم كيفية إنشاء تصاميم لصفحات الويب والهواتف النقالة بصورة واضحة احترافية، وإمكانية إضافة ألوان وإسقاطات مناسبة، واستيراد ملفات متعددة في نفس الوقت، علاوةً عن تعلم كيفية تصميم ناقلات متعددة.', NULL, NULL),
(34, 'التسويق عبر وسائل التواصل الإجتماعي', 'دليلك-إلى-التسويق-عبر-مواقع-التواصل-الاجتماعي.png', '212', '24', '', '4', 'يُعد التسويق عبر مواقع التواصل الاجتماعي من أبرز الوسائل للتسويق في الوقت الحالي، حيث تعتمد عليها الكثير من الشركات والمؤسسات في نشاطهم التجاري، كما أصبحت وسيلةً يتنافس عبرها مقدمي الخدمات وبائعي المنتجات لزيادة المبيعات وجذب العملاء؛ لذا صُممت دورة التسويق عبر وسائل التواصل الاجتماعية SMM لمساعدة المتدربين على الوصول إلى العملاء المستهدفين من خلال شبكات ووسائل التواصل الاجتماعية وشبكة الانترنت، فضلًا عن التفاعل المستمر وتحسين التواصل مع العملاء، وتطوير العلاقة مع الزبائن بشكل كبير، وتوسيع قاعدة العملاء. ستساعدك هذه الدورة التدريبية على معرفة الطرق، وتقنيات، والتكتيكات التي تمكنك من تحسين أدائك التسويقي والترويج لمنتجاتك وخدماتك من خلال استخدام مختلف وسائط ومواقع التواصل الاجتماعي.', NULL, NULL),
(35, 'الأيلتس الأكاديمي\r\nدورة تحضيرية', 'ielts.webp', '254', '50', '', '5', ' \r\n\r\nالآن، يمكنك إجراء اختبار القراءة IELTS بثقة من خلال الدورة التحضيرية ايلتس IELTS -مهارات القراءة التي تمثل دليلاً كاملاً لكل ما يحتاج المشارك إلى معرفته من خلال التعريف باستراتيجيات القراءة العامة التي ستساعده على التعامل مع مختلف أنواع  النصوص التي قد يُصادفها المشارك خلال اختبار IELTS لتنمية قدراته على التركيز على المعلومات الرئيسية والمهمة، باستخدام المهارات الفرعية كالقراءة السريعة. بالإضافة إلى ذلك، تستعرض هذه الدورة أنواع الأسئلة المختلفة وكيفية الإجابة عليها.', NULL, NULL),
(36, 'اللغة الإنجليزية للمبتدئين', 'téléchargement.png', '212', '32', '', '5', 'أساسي أ\r\nتهدف دورات اللغة الإنجليزية العامة إلى تطوير مهارات المشاركين باللغة الإنجليزية سواء أكانوا مبتدئين أو متقدمين، بحيث تتضمن تعليمات خطوة بخطوة وتمارين ومناقشات وفعاليات لجعل عملية التعلم مرنة وممتعة لتمكين المتدربين من تحسين انجليزيتهم وفهم قواعد اللغة وتطبيقها اثناء التحدث. في البداية يتم فحص مستوى اللغة لدى المتدربين لتسجيلهم بالمستوى الذي يناسبهم حيث أن دورات اللغة الإنجليزية العامة تتكون من 12 مستوى تبدأ من المستوى الأساسي أ، المستوى الأساسي ب، المستوى الأول، الثاني، الثالث، ...إلى العاشر.\r\nيغطي برنامج اللغة الإنجليزية للمبتدئين المستويات الأساسية أ و ب لتزويد المشاركين بالأساسات العامة وتعزيز معرفتهم باللغة الإنجليزية وإعدادهم وتأهيلهم للانضمام إلى المستويات العليا بثقة.', NULL, NULL),
(37, 'المحادثة باللغة الإنجليزية', 'How-to-Learn-Spoken-English_.png', '24', '127', '', '5', 'صُممت دورة المحادثة باللغة الإنجليزية لتطوير المهارات اللغوية والإدراكية للمشتركين وزيادة قدرتهم في المحادثة، حيث يتم التركيز خلال الدورة على كيفية عمل الاتصال وتشجيع المشاركين على التفاعل واستخدام اللغة الإنجليزية كلغة حوار من خلال التطرق لمواضيع متنوعة خاصة في القراءة والاستماع والمحادثة، مما يساعد المشترك على تطوير مهارات المحادثة واستخدام اللغة بطلاقة كوسيلة للتخاطب واستخدام القواعد اللغوية المتقدمة وإعدادات اللغة بشكل أسرع دون الحاجة لمساعدة في الترجمة.', NULL, NULL),
(38, 'اللغة الإنجليزية - المستوى الأساسي', 'English-Language-Level-System-704x350.jpg', '212\r\n', '32', '', '5', 'يقدم المستوى الأساسي بمستوييه الأول والثاني للمشتركين كافة أساسيات بنية اللغة الإنجليزية مما يساعدهم على التدرج في فهم القواعد الأساسية ومفردات اللغة وتوظيفها في السياقات العامة.\r\n\r\nيتضمن المستوى الأول تعريفاً شاملاً بضمائر الملكية والمتكلم والعديد من المفردات الهامة وأسماء الدول، كما يتم تدريب المشترك على كيفية إلقاء التحية على الأشخاص والتعريف عن أنفسهم واستخدام أفعال الكينونة Verb to be والأفعال المستخدمة في التعبير عن قدرة الشخص مثل فعل Can، ثم توظيفها في حالات النفي والسؤال.\r\n\r\nيمكن للمشترك من خلال هذه الدورة التعرف على طرق كتابة البريد الإلكتروني والرسائل بطرق أكثر احترافية سواء كانت رسمية أو غير رسمية، بالإضافة إلى التعرف على تصاريف الأفعال المضارعة البسيطة والقدرة على التحدث بطلاقة بلغة خالية من الأخطاء.\r\n\r\nتتضمن الدورة محاور تسهم بشكل كبير في زيادة قدرة الشخص بالتعبير عن نفسه والتحدث عن مهنته ودراسته ووصف مكان سكنه واستخدام أحرف الجر في مكانها الصحيح واستخدام الكلمات التي تعبر عن الاتجاهات.', NULL, NULL),
(39, 'اللغة الإنجليزية - المستوى دون المتوسط', 'p03zh5tk.jpg', '212', '32', '', '5', 'صُمم برنامج اللغة الإنجليزية-المستوى دون المتوسط بمستوييه الثالث والرابع لزيادة قدرة المشترك على استخدام اللغة الإنجليزية ومفرداتها بشكل أدق وأكثر احترافية وذلك من خلال تقديم مجموعة متنوعة من الأنشطة والمواد التعليمية في المستوى الثالث منه.\r\n\r\nسيتمكن المشترك في المستوى الرابع من التعرف على مهارات الاشتقاق والمفردات من خلال الدخول في مجموعات متنوعة من فقرات القراءة والاستماع التي تتضمن حوارات بمفردات جديدة ومتنوعة تسهم بشكل كبير في تعزيز وزيادة مضمون المفردات لدى المشترك بعد تركيزه على فهمها وحفظها وممارستها في حياته اليومية', NULL, NULL),
(40, 'اللغة الإنجليزية - المستوى المتوسط', 'istockphoto-1288019626-612x612.jpg', '212', '32', '', '5', 'صمم برنامج اللغة الإنجليزية-المستوى المتوسط بمستوييه الخامس والسادس لتمكين المشتركين من استخدام المفردات ومهارات القواعد والكتابة والقراءة، حيث يتم خلال الدورة تقديم مجموعة واسعة ومتنوعة من التمارين التفاعلية التي تركز على التعبيرات وأشباه الجمل والفرق بين اللغة الإنجليزية الرسمية وغير الرسمية.\r\n\r\nتتضمن الدورة أنشطة تسهم بشكل كبير في توفير معرفة شاملة لدى الطلاب حول الامتحانات الدولية مثل TOEFL وIELTS، الأمر الذي يجعل هذه الدورة فرصة كبيرة لتطوير مهارات اللغة الإنجليزية لدى المشترك وزيادة قدرته في التعبير عن نفسه بشكل جيد باستخدام تعابير دقيقة وفعالة', NULL, NULL),
(41, 'أنواع التفكير والتركيز على التفكير الإبداعي', '6-factors-human-thinking-skills.jpg', '282 ', '35', '', '6', 'صُممت دورة أنواع التفكير والتركيز على التفكير الإبداعي لتعريف المشتركين على ما يسمى بالتفكير الإبداعي في التدريس والذي يساعد المعلمين على ابتكار أفكار جديدة في التعليم تسهم في تنمية أفكار الطلاب وإيصال المعلومة لهم بشكل إبداعي.\r\n\r\nتتضمن الدورة محاور تساهم في تعريف المشترك على دور التكنولوجيا في تنمية التفكير الإبداعي والتفكير المفتوح لدى المعلم والطالب، كما تسهم في تمكين المشترك من استراتيجيات التعلم من حلال حل المشكلات.\r\n\r\nتسهم الدورة في تعريف المشترك على مواصفات المدرسة المنشودة حالياً في ضوء التطورات التكنولوجية التي ساهمت في تطوير عملية التعلم والتعليم، والتعرف على كيفية التغيير وإدارة التغيير في المدرسة، كما يمكن للمشترك معرفة كيفية التعلم المعتمد على المدرسة البنائية.\r\n\r\n', NULL, NULL),
(42, 'المعلم الداعم', 'BLD_P04_05102021_ED1-1.jpg', '282', '40', '', '6', 'صُممت دورة المعلم الداعم لتطوير مهارات المعلم ليكون قادراً على تحديد احتياجات الطلاب والعملية التعليمية وتقييم استخدام أدوات التكنولوجيا في التعليم وتقديم الدعم المناسب للمعلمين الآخرين بناءً على احتياجاتهم.\r\n\r\nتهتم هذه الدورة بتمكين المشتركين من مهارات القيادة وبناء الفريق المناسب وتعلم مهارات الاتصال والتواصل بين أفراد الفريق الواحد، ومهارات العرض والتقديم الجيد، بالإضافة إلى تعريف المشتركين كيفية إعطاء تغذية راجعة وتلقيها من الآخرين.\r\n\r\nتتضمن الدورة محاور تساهم في تمكين المشتركين من مهارات التدريب وتصميم المحتوى التدريبي المناسب الذي يساهم في تقديم عملية تعليمية متقدمة خالية من الأخطاء.', NULL, NULL),
(43, 'البيئة التعليمية', 'التعليم الالكتروني.webp', '212', '25', '', '6', 'تهدف دورة البيئة التعليمية إلى تمكين المتدربين من أسس مهنة التعليم ومكوناتها وكيفية التعامل مع الغرفة الصفية وإدارتها وجاهياً وعن بعد، كما يمكن للمشترك من خلال الدورة معرفة كيفية إيجاد بيئة تعلم آمنة ومحفزة للمتدربين وكيفية غرس السلوكيات الجيدة في نفوس الطلبة، بالإضافة إلى التعرف على المشكلة الأبرز لديهم وهي التأخر الدراسي وكيفية التعامل معها والارتكاز على أسس نظرية التعلم البنائية في تدريس الطلبة لمساعدة المعلمين على جعل التعلم فعالاً.\r\n\r\nتتضمن الدورة أهم الأدوات التكنولوجية التي تساعد المعلمين على الاتصال والتواصل معاً ثم الاستعانة بهذه الأدوات والتطبيقات التي تساعدهم في ضبط الغرفة الصفية وإدارتها بشكل فعال مما يُمكنهم من تحقيق الأهداف التربوية المنشودة.\r\n\r\nستتناول دورة البيئة التعليمية الامكانات غير المحدودة لتكنولوجيا المعلومات والاتصالات في التعليم، وأن التوظيف الفعال لهذه الوسائل يعني إحداث تغيير في أساليب التعليم والتعلم وفي دور الطالب والمعلم وفي المحتوى الدراسي أيضا، كما سيتعرف المشترك من الدورة على أهم الاستخدامات المتعددة لتكنولوجيا المعلومات والاتصالات في التعليم بحيث يمكن للمعلم تحديد المناسب منها لاستخدامه في غرفته الصفية.\r\n\r\nيمكن للمعلم من خلال الدورة تطوير مهارات عملية في تصميم وتقديم أنشطة صفية مرتبطة بتكنولوجيا المعلومات والاتصالات، وتنمية مهارة التأمل لدى المعلم.', NULL, NULL),
(44, 'التخطيط للتدريس', 'top-5-planning-information.jpg', '282 ', '35', '', '6', 'تهدف دورة التخطيط للتدريس إلى تعريف المشتركين على مواصفات خطة الدرس ومكوناتها وسمات المتعلمين وتوظيف تلك المعرفة في النشاط اليومي للمعلم وجاهياً وعن بعد والتخطيط الفعال لمخاطبة تلك السمات، حيث يتم التعرف على مفهوم وصياغة الأهداف التعليمية المعرفية والسلوكية والوجدانية ومستويات كل منها.\r\n\r\nتتطرق الدورة إلى أهم استراتيجيات التدريس الحديثة واستخدامات كل منها مع استراتيجيات تنمية التفكير لدى الطلبة، كما سيتعرف المشترك على دور التكنولوجيا في مراعاة الفروق الفردية وتطبيق بعض الأدوات المناسبة التي لها دور في التخطيط للتدريس الوجاهي وعن بعد.', NULL, NULL),
(45, 'اوتوكاد\r\nللرسم الميكانيكي', '791fbe9c2c52b2dedefd67242a603e12.jpg', '140', '24', '', '7', 'صممت دورة أوتوكاد للرسم الميكانيكي لتمكين المشاركين من استخدام برنامج الأوتوكاد والالمام بالأدوات والتقنيات لإنتاج رسومات وتصاميم هندسية في العديد من المجالات والمهن والصناعات، بالاضافة لكيفية إنشاء رسومات تفصيلية ثنائية الأبعاد والتي تتضمن بشكل رئيسي المخططات الميكانيكية.\r\n\r\nستتضمن الدورة تطبيقات عملية ومناقشات لتعزيز الجانب العملي لدى المشاركين بحيث يتعين على المشاركين إعداد مشروع نهائي لاجتياز الدورة وضمان تحقيقهم للأهداف المرجوة منها.', NULL, NULL),
(46, 'اوتوكاد\r\nللرسم الكهربائي', 'maxresdefault.jpg', '140', '24', '', '7', 'صممت دورة أوتوكاد للرسم الكهربائي لتمكين المشاركين من استخدام برنامج الأوتوكاد والالمام بالأدوات والتقنيات لإنتاج رسومات وتصاميم هندسية في العديد من المجالات والمهن والصناعات، بالاضافة لكيفية إنشاء رسومات تفصيلية ثنائية الأبعاد والتي تتضمن بشكل رئيسي المخططات الكهربائية.\r\n\r\nستتضمن الدورة تطبيقات عملية ومناقشات لتعزيز الجانب العملي لدى المشاركين بحيث يتعين على المشاركين إعداد مشروع نهائي لاجتياز الدورة وضمان تحقيقهم للأهداف المرجوة منها.\r\n\r\n', NULL, NULL),
(47, 'صيانة سيارات الهايبرد والكهرباء', 'صيانة_سيارات.jpg', '423', '60', '', '7', 'استحدثت دورة صيانة سيارات الهايبرد و الكهرباء لإكساب المشاركين المهارات اللازمة لصيانة المركبات الهجينة و الكهربائية و تعريفهم بالمفاهيم الخاصة بالمركبات والتطبيقات المتعلقة بالأنظمة ذات الجهد المرتفع مثل: أنواع البطاريات والمحركات ووحدات التحكم بالطاقة التي تربط أجزاء النظام ببعضها البعض، كما سيتم إكساب المشاركين المهارات العملية والتطبيقية في مختبرات ومشاغل فنية متخصصة.', NULL, NULL),
(48, 'ريفيت\r\nالهندسة الكهربائية', 'ما_هي_هندسة_الكهرباء.jpg', '240', '24', '', '7', 'صممت دورة ريفيت الهندسة الكهربائية لتمكّنك من استخدام الميزات والأدوات المتقدمة الخاصة بالبرنامج والمتعلقة بأعمال هندسة الكهرباء التي يستخدمها المهندسون كجزء من تصميم وتحليل وتوثيق مشاريع أنظمة المباني، كما تهدف الدورة الى رفع كفاءة المشاركين للمستوى الاحترافي من خلال تطبيق مشاريع وممارسات عملية حقيقية موجودة على ارض الواقع.\r\n\r\nيعد برنامج ريفيت البرنامج الأحدث لتصميم ونمذجة معلومات البناء BIM لمهندسي الأنظمة الكهربائية.', NULL, NULL),
(49, 'تصميم الأعمال الكهربائية', 'الهندسة_الكهربائية_ومستقبلها.jpg', '599', '60', '', '7', 'تم تصميم دورة الأعمال الكهربائية لتزويد المشاركين بأساسيات وطرق تصميم أعمال الكهرباء للأبنية عن طريق تعريف وتوعية المشاركين بالأساسيات والمهارات المختلفة لتصميم الأعمال الكهربائية بحيث ترتكز الدورة على تعلم آلية حساب الأحمال الكهربائية التمديدات الكهربائية بكافة مجالاتها،  تصميم وتركيب لوحات التوزيع، أنواع الكوابل وحساب مساحة مقطعها، وكذلك التصميم باستخدام العديد من برامج الحاسوب. بالإضافة الى ذلك،  ستؤهل هذه الدورة المشاركين من تصميم الأعمال الكهربائية لمشاريعهم الخاصة.', NULL, NULL),
(50, 'تصميم الأعمال الميكانيكية', 'مراحل-الأعمال-الميكانيكية-في-التشييد-والبناء.jpeg', '599', '70', '', '7', 'صممت دورة تصميم الأعمال الميكانيكية لتأهيل المشاركين وخصوصاً المهندسين الميكانيكيين للعمل في مجال تخصصهم عن طريق تزويدهم بالمعرفة اللازمة للعمل في مجال المقاولات،  بحيث تتناول هذه الدورة الشاملة جميع المواضيع المتعلقة في الأعمال الميكانيكية الخاصة بكل من المباني السكنية وكذلك التجارية، مثل أنظمة التكييف والتبريد، مكافحة الحريق، الهواء المضغوط، غاز البترول، والعديد من المواضيع الأخرى.', NULL, NULL),
(51, 'ريفيت\r\nالهندسة الميكانيكية', 'نبذة_عن_الهندسة_الميكانيكية.jpg', '240', '24', '', '7', 'صممت دورة ريفيت الهندسة الميكانيكية لتمكّنك من استخدام الميزات والأدوات المتقدمة الخاصة بالبرنامج والمتعلقة بأعمال هندسة الميكانيك والسباكة التي يستخدمها المهندسون كجزء من تصميم وتحليل وتوثيق مشاريع أنظمة المباني، كما تهدف الدورة الى رفع كفاءة المشاركين للمستوى الاحترافي من خلال تطبيق مشاريع وممارسات عملية حقيقية موجودة على ارض الواقع.\r\n\r\nيعد برنامج ريفيت البرنامج الأحدث لتصميم ونمذجة معلومات البناء BIM لمهندسي الأنظمة الميكانيكية.', NULL, NULL),
(52, 'تقنية سيارات الهايبرد', 'screen_shot_2019_02_18_at_104526_am_1024x640.png', '539 ', '20', '', '7', 'النظام الهجين هو موجة من المستقبل، بحيث أدى النمو السكاني السريع والتنمية الاقتصادية في العقود الأخيرة إلى زيادة حادة في استهلاك الوقود على مستوى العالم وأدى إلى زيادة التلوث في الجو، وهذه العوامل جميعها أدت إلى الحاجة الماسة لوجود مادة تدريبية تقوم بشرح النظام بشكل كامل ومعرفة أجزاءه ومعرفة أهميته وكيفية عمل صيانة له.\r\n\r\nتستخدم المركبة الهجينة نوعين منفصلين أو أكثر من الطاقة، مثل محرك الاحتراق الداخلي الذي يعمل على تشغيل مولد كهربائي يعمل على تشغيل المحرك الكهربائي، على سبيل المثال، في القطارات الهجينة، تقوم محركات الديزل بتشغيل المولد الكهربائي الذي يعمل على تشغيل المحرك الكهربائي. يهدف مساق السيارات الهايبرد إلى إكساب المتدربين المعرفة الكافية في تصنيفات السيارات الهجينة، أجزاء ومكونات السيارات الهجينة، ومميزات وعيوب السيارات الهجينة.', NULL, NULL),
(53, 'كهرباء السيارات الحديثة', 'كيف_أتعلم_كهرباء_السيارات؟.jpeg', '599 ', '20', '', '7', 'تم تصميم دورة كهرباء السيارات الحديثة لاكساب المشاركين الأساسيات الكهربائية والإلكترونية  الخاصة بالسيارات الحديثة وحساباتها بلغة سهلة ومبسطة، كما سيتم تعريفهم بأجهزة قياس وحماية الدوائر الكهربائية وأنواعها والتركيب الرئيسي لها وطرق فحصها.\r\n\r\nكما تهدف الدورة إلى اكساب المشاركين المعرفة التامة بأنواع البطاريات وتركيبها ومبدأ عملها والعوامل التي تؤثر بها وطرق فحصها، بالاضافة إلى تعريفهم على بادئ الحركة والأجزاء الرئيسية لمنظومة بدء الحركة، وتمكنهم من قراءة المخططات الكهربائية لبادئ الحركة واختبارات منظومة الحركة في حال حصول أعطال معينة.', NULL, NULL),
(54, 'محركات الإحتراق الداخلي', '2014202003073365.png', '240', '16', '', '7', 'صممت دورة محركات الاحتراق الداخلي لاكساب المشاركين  المفاهيم الأساسية ومبدأ عمل المحرك، معرفة جميع أجزائه ووظائفها داخل المحرك، ومعرفة بعض الأنظمة المساعدة للمحرك .\r\n\r\nكما تهدف الدورة على التعرف اكساب المشاركين المهارات  التقنية في فك وتركيب أجزاء المحرك، وكذلك تعريفهم على نظام التبريد وأجزاءه وأهم أعطال نظام التبريد.', NULL, NULL),
(55, 'الرخصة الدولية في قيادة الحاسوب', 'صورة_التخصص_ICDL_أفقي.jpg', '127', '54', '', '8', '\r\nصُممت دورة الرخصة الدولية لقيادة الحاسوب لتطوير مهارات المشاركين وتعزيز قدرتهم على التعامل مع أجهزة الحاسوب وتطبيقاتها العامة، حيث يتم تزويد المشترك بالمهارات والكفاءات اللازمة لاستخدام جهاز الحاسوب وتطبيقاته في المستوى المطلوب لأي عمل، وذلك من خلال تقديم أمثلة عملية للتنفيذ تسهم في تعزيز قدرات المشترك بشكل أكبر، كما توفر الدورة فرصة كبيرة لتطوير كفاءة المشترك للتطوير الوظيفي في المستقبل أو التطوير المهني المستمر.\r\n\r\nتعد هذه الدورة من أهم الفرص لدى المشتركين لتعزيز سيرتهم الذاتية ومساعدتهم في الحصول على الوظائف بشكل أسرع، حيث تسهم الدورة في تطوير مهارات المشترك الرقمية بما يتوافق مع معايير التدريب العالمية وفقاً لمناهج ECDL الرسمية التي تعد الجهة المانحة للشهادات الخاصة بالبرامج الدولية الرائدة لاعتماد مهارات الحاسوب لتدريب وعقد امتحانات دورة ICDL.', NULL, NULL),
(56, 'خدمات الحركة الجوية', 'téléchargement.jpeg', '247', '50', '', '9', 'تم تصميم دورة الخدمات الجوية لتزويد المشاركين بالمهارات اللازمة لتمكينهم من قيادة وتوفير التوجيه في جميع جوانب الأنشطة والخدمات المقدمة أثناء الطيران والاقلاع، عن طريق تزويدهم بأهم معايير وإجراءات الصناعة الموصى بها، بالإضافة إلى إنشاء ودعم وإدارة مجموعات وفرق العمل.', NULL, NULL);

-- --------------------------------------------------------

--
-- Structure de la table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `livecourses`
--

CREATE TABLE `livecourses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `livecourses`
--

INSERT INTO `livecourses` (`id`, `name`, `image`, `created_at`, `updated_at`) VALUES
(1, 'البرمجة', '1.svg', NULL, NULL),
(2, 'الشبكات وامن المعلومات', '5.svg', NULL, NULL),
(3, 'الادارة والمحاسبة', '6.svg', NULL, NULL),
(4, 'التصميم الجرافيكي والمعماري', '4.svg', NULL, NULL),
(5, 'اللغات', '2.svg', NULL, NULL),
(6, 'تكنولوجيا التعليم الرقمي', '11.svg', NULL, NULL),
(7, 'الهندسة', '3.svg', NULL, NULL),
(8, 'مهارات الحاسوب', '7.svg', NULL, NULL),
(9, 'ادارة المطارات و علوم السياحة و السفر', '12.svg', NULL, NULL);

-- --------------------------------------------------------

--
-- Structure de la table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_reset_tokens_table', 1),
(3, '2014_10_12_100000_create_password_resets_table', 1),
(4, '2019_08_19_000000_create_failed_jobs_table', 1),
(5, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(6, '2023_10_04_173133_create_recordcourses_table', 1),
(7, '2023_10_04_210531_create_livecourses_table', 2),
(8, '2023_10_05_150756_create_allrecords_table', 3);

-- --------------------------------------------------------

--
-- Structure de la table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `recordcourses`
--

CREATE TABLE `recordcourses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `recordcourses`
--

INSERT INTO `recordcourses` (`id`, `name`, `image`, `created_at`, `updated_at`) VALUES
(1, 'البرمجة', '1.svg', NULL, NULL),
(2, 'الشبكات و امن المعلومات\r\n', '5.svg', NULL, NULL),
(3, 'الادارة و المحاسبة \r\n', '6.svg', NULL, NULL),
(4, 'التصميم الجرافيكي و المعماري', '4.svg', NULL, NULL),
(5, 'اللغات\r\n', '2.svg', NULL, NULL),
(6, 'تكنولوجيا التعليم الرقمي', '11.svg', NULL, NULL),
(7, 'الهندسة', '3.svg', NULL, NULL),
(8, 'مهارات الحاسوب \r\n', '7.svg', NULL, NULL),
(9, ' الادارة الطبية والتجميل ', '13.svg', NULL, NULL),
(10, 'ادارة المطارات و علوم السياحة و السفر', '12.svg', NULL, NULL),
(11, 'النفط و الغاز', '14.svg', NULL, NULL),
(12, 'القانون ', '8.svg', NULL, NULL),
(13, 'السلامة و الصحة المهنية', '15.svg', NULL, NULL),
(14, 'الصحافة و الاعلام الرقمي', '10.svg', NULL, NULL),
(15, 'تصميم الأزياء', '16.png', NULL, NULL),
(16, 'تصميم المجوهرات\r\n', '9.svg', NULL, NULL);

-- --------------------------------------------------------

--
-- Structure de la table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'monsef', 'xr.monsef@gmail.com', NULL, '$2y$10$VaDS7I6TYM.Q2sd1WsGi6Oxy5wYRJoIuxPuBQ3PXdbmGwj1Y7nTcW', NULL, '2023-10-05 10:52:42', '2023-10-05 10:52:42');

--
-- Index pour les tables déchargées
--

--
-- Index pour la table `allrecords`
--
ALTER TABLE `allrecords`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Index pour la table `livecourses`
--
ALTER TABLE `livecourses`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Index pour la table `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Index pour la table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Index pour la table `recordcourses`
--
ALTER TABLE `recordcourses`
  ADD PRIMARY KEY (`id`);

--
-- Index pour la table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT pour les tables déchargées
--

--
-- AUTO_INCREMENT pour la table `allrecords`
--
ALTER TABLE `allrecords`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=57;

--
-- AUTO_INCREMENT pour la table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT pour la table `livecourses`
--
ALTER TABLE `livecourses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT pour la table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT pour la table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT pour la table `recordcourses`
--
ALTER TABLE `recordcourses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT pour la table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
